results/factorial-final/security-overhead-final-plaintext-broker3/security-overhead-final-factorial-plaintext-b3-rf3-isr3-msg102400-tps1000-batch131072-acksall-prod6-compnone-trial2/producer-perf-2.log
producer_index=2
producer_count=6
producer_records=16667
producer_throughput=167
215 records sent, 42.8 records/sec (4.18 MB/sec), 480.9 ms avg latency, 3341.0 ms max latency.
784 records sent, 156.7 records/sec (15.31 MB/sec), 108.4 ms avg latency, 577.0 ms max latency.
914 records sent, 182.4 records/sec (17.81 MB/sec), 22.5 ms avg latency, 164.0 ms max latency.
892 records sent, 178.3 records/sec (17.41 MB/sec), 15.5 ms avg latency, 59.0 ms max latency.
886 records sent, 177.2 records/sec (17.30 MB/sec), 14.6 ms avg latency, 67.0 ms max latency.
858 records sent, 171.5 records/sec (16.75 MB/sec), 17.6 ms avg latency, 85.0 ms max latency.
861 records sent, 172.2 records/sec (16.82 MB/sec), 15.6 ms avg latency, 78.0 ms max latency.
913 records sent, 181.8 records/sec (17.75 MB/sec), 15.8 ms avg latency, 57.0 ms max latency.
939 records sent, 187.6 records/sec (18.32 MB/sec), 17.8 ms avg latency, 110.0 ms max latency.
920 records sent, 183.9 records/sec (17.96 MB/sec), 20.1 ms avg latency, 182.0 ms max latency.
948 records sent, 189.6 records/sec (18.51 MB/sec), 14.4 ms avg latency, 74.0 ms max latency.
909 records sent, 181.4 records/sec (17.72 MB/sec), 13.4 ms avg latency, 68.0 ms max latency.
796 records sent, 156.9 records/sec (15.33 MB/sec), 176.8 ms avg latency, 844.0 ms max latency.
887 records sent, 177.2 records/sec (17.31 MB/sec), 179.6 ms avg latency, 996.0 ms max latency.
835 records sent, 167.0 records/sec (16.31 MB/sec), 11.8 ms avg latency, 104.0 ms max latency.
838 records sent, 167.4 records/sec (16.35 MB/sec), 9.8 ms avg latency, 65.0 ms max latency.
836 records sent, 167.2 records/sec (16.32 MB/sec), 9.3 ms avg latency, 60.0 ms max latency.
835 records sent, 166.9 records/sec (16.30 MB/sec), 9.5 ms avg latency, 65.0 ms max latency.
836 records sent, 167.1 records/sec (16.32 MB/sec), 9.4 ms avg latency, 81.0 ms max latency.
16667 records sent, 166.933755 records/sec (16.30 MB/sec), 41.27 ms avg latency, 3341.00 ms max latency, 12 ms 50th, 258 ms 95th, 569 ms 99th, 814 ms 99.9th.